HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxMsc_regdef.h
/** \\brief  Downstream Data Register */
typedef struct _Ifx_MSC_DD_Bits
{
    unsigned int DDL:16;                    /**< \brief [15:0] Downstream Data for SRL Shift Register (rw) */
    unsigned int DDH:16;                    /**< \brief [31:16] Downstream Data for SRH Shift Register (rw) */
} Ifx_MSC_DD_Bits;

/** \\brief  Downstream Data Extension Register */
typedef struct _Ifx_MSC_DDE_Bits
{
    unsigned int DDLE:16;                   /**< \brief [15:0] Downstream Data Extension for SRL Shift Register (rw) */
    unsigned int DDHE:16;                   /**< \brief [31:16] Downstream Data Extension for SRH Shift Register (rw) */
} Ifx_MSC_DDE_Bits;

/** \\brief  Downstream Data Mirror Register */
typedef struct _Ifx_MSC_DDM_Bits
{
    unsigned int DDLM:16;                   /**< \brief [15:0] Downstream Data Mirror for SRL Shift Register (w) */
    unsigned int DDHM:16;                   /**< \brief [31:16] Downstream Data Mirror for SRH Shift Register (w) */
} Ifx_MSC_DDM_Bits;

/** \\brief  Downstream Control Register */
typedef struct _Ifx_MSC_DSC_Bits
{
    unsigned int TM:1;                      /**< \brief [0:0] Transmission Mode (rw) */
    unsigned int CP:1;                      /**< \brief [1:1] Command Pending (rh) */
    unsigned int DP:1;                      /**< \brief [2:2] Data Pending (rh) */
    unsigned int NDBL:5;                    /**< \brief [7:3] Number of SRL Bits Shifted at Data Frames (rw) */
    unsigned int NDBH:5;                    /**< \brief [12:8] Number of SRH Bits Shifted at Data Frames (rw) */
    unsigned int ENSELL:1;                  /**< \brief [13:13] Enable SRL Active Phase Selection Bit (rw) */
    unsigned int ENSELH:1;                  /**< \brief [14:14] Enable SRH Active Phase Selection Bit (rw) */
    unsigned int DSDIS:1;                   /**< \brief [15:15] Downstream Disable (rh) */
    unsigned int NBC:6;                     /**< \brief [21:16] Number of Bits Shifted at Command Frames (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int PPD:5;                     /**< \brief [28:24] Passive Phase Length at Data Frames (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_MSC_DSC_Bits;

/** \\brief  Downstream Control Enhanced Register 1 */
typedef struct _Ifx_MSC_DSCE_Bits
{
    unsigned int NDBHE:1;                   /**< \brief [0:0] Number of SRH Bits Shifted at Data Frames Extension (rw) */
    unsigned int NDBLE:1;                   /**< \brief [1:1] Number of SRH Bits Shifted at Data Frames Extension (rw) */
    unsigned int reserved_2:12;             /**< \brief \internal Reserved */
    unsigned int EXEN:1;                    /**< \brief [14:14] Extension Enable (rw) */
    unsigned int CCF:1;                     /**< \brief [15:15] Command-Comand Flag (rh) */
    unsigned int INJENP0:1;                 /**< \brief [16:16] Injection Enable of the Pin 0 Signal (rw) */
    unsigned int INJPOSP0:6;                /**< \brief [22:17] Injection Position of the Pin 0 Signal (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int INJENP1:1;                 /**< \brief [24:24] Injection Enable of the Pin 1 Signal (rw) */
    unsigned int INJPOSP1:6;                /**< \brief [30:25] Injection Position of the Pin 1 Signal (rw) */
    unsigned int CDCM:1;                    /**< \brief [31:31] Command-Data-Comand in Data Repetition Mode (rw) */
} Ifx_MSC_DSCE_Bits;

/** \\brief  Downstream Select Data Source High Register */
typedef struct _Ifx_MSC_DSDSH_Bits
{
    unsigned int SH0:2;                     /**< \brief [1:0] Select Source for SRH (rw) */
    unsigned int SH1:2;                     /**< \brief [3:2] Select Source for SRH (rw) */
    unsigned int SH2:2;                     /**< \brief [5:4] Select Source for SRH (rw) */
    unsigned int SH3:2;                     /**< \brief [7:6] Select Source for SRH (rw) */
    unsigned int SH4:2;                     /**< \brief [9:8] Select Source for SRH (rw) */
    unsigned int SH5:2;                     /**< \brief [11:10] Select Source for SRH (rw) */
    unsigned int SH6:2;                     /**< \brief [13:12] Select Source for SRH (rw) */
    unsigned int SH7:2;                     /**< \brief [15:14] Select Source for SRH (rw) */
    unsigned int SH8:2;                     /**< \brief [17:16] Select Source for SRH (rw) */
    unsigned int SH9:2;                     /**< \brief [19:18] Select Source for SRH (rw) */
    unsigned int SH10:2;                    /**< \brief [21:20] Select Source for SRH (rw) */
    unsigned int SH11:2;                    /**< \brief [23:22] Select Source for SRH (rw) */
    unsigned int SH12:2;                    /**< \brief [25:24] Select Source for SRH (rw) */
    unsigned int SH13:2;                    /**< \brief [27:26] Select Source for SRH (rw) */
    unsigned int SH14:2;                    /**< \brief [29:28] Select Source for SRH (rw) */
    unsigned int SH15:2;                    /**< \brief [31:30] Select Source for SRH (rw) */
} Ifx_MSC_DSDSH_Bits;

/** \\brief  Downstream Select Data Source High Register */
typedef struct _Ifx_MSC_DSDSHE_Bits
{
    unsigned int SH16:2;                    /**< \brief [1:0] Select Source for SRH (rw) */
    unsigned int SH17:2;                    /**< \brief [3:2] Select Source for SRH (rw) */
    unsigned int SH18:2;                    /**< \brief [5:4] Select Source for SRH (rw) */
    unsigned int SH19:2;                    /**< \brief [7:6] Select Source for SRH (rw) */
    unsigned int SH20:2;                    /**< \brief [9:8] Select Source for SRH (rw) */
    unsigned int SH21:2;                    /**< \brief [11:10] Select Source for SRH (rw) */
    unsigned int SH22:2;                    /**< \brief [13:12] Select Source for SRH (rw) */
    unsigned int SH23:2;                    /**< \brief [15:14] Select Source for SRH (rw) */
    unsigned int SH24:2;                    /**< \brief [17:16] Select Source for SRH (rw) */
    unsigned int SH25:2;                    /**< \brief [19:18] Select Source for SRH (rw) */
    unsigned int SH26:2;                    /**< \brief [21:20] Select Source for SRH (rw) */
    unsigned int SH27:2;                    /**< \brief [23:22] Select Source for SRH (rw) */
    unsigned int SH28:2;                    /**< \brief [25:24] Select Source for SRH (rw) */
    unsigned int SH29:2;                    /**< \brief [27:26] Select Source for SRH (rw) */
    unsigned int SH30:2;                    /**< \brief [29:28] Select Source for SRH (rw) */
    unsigned int SH31:2;                    /**< \brief [31:30] Select Source for SRH (rw) */
} Ifx_MSC_DSDSHE_Bits;

