HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxMsc_regdef.h
/** \\brief  Downstream Select Data Source High Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSDSHE_Bits B;
} Ifx_MSC_DSDSHE;

/** \\brief  Downstream Select Data Source Low Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSDSL_Bits B;
} Ifx_MSC_DSDSL;

/** \\brief  Downstream Select Data Source Low Extension Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSDSLE_Bits B;
} Ifx_MSC_DSDSLE;

/** \\brief  Downstream Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSS_Bits B;
} Ifx_MSC_DSS;

/** \\brief  Downstream Timing Extension Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DSTE_Bits B;
} Ifx_MSC_DSTE;

/** \\brief  Emergency Stop Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ESR_Bits B;
} Ifx_MSC_ESR;

/** \\brief  Emergency Stop Extension Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ESRE_Bits B;
} Ifx_MSC_ESRE;

/** \\brief  Fractional Divider Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_FDR_Bits B;
} Ifx_MSC_FDR;

/** \\brief  Interrupt Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ICR_Bits B;
} Ifx_MSC_ICR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ID_Bits B;
} Ifx_MSC_ID;

/** \\brief  Interrupt Set Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ISC_Bits B;
} Ifx_MSC_ISC;

/** \\brief  Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ISR_Bits B;
} Ifx_MSC_ISR;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_KRST0_Bits B;
} Ifx_MSC_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_KRST1_Bits B;
} Ifx_MSC_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_KRSTCLR_Bits B;
} Ifx_MSC_KRSTCLR;

/** \\brief  Output Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_OCR_Bits B;
} Ifx_MSC_OCR;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_OCS_Bits B;
} Ifx_MSC_OCS;

/** \\brief  Upstream Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_UD_Bits B;
} Ifx_MSC_UD;

/** \\brief  Upstream Control Enhanced Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_USCE_Bits B;
} Ifx_MSC_USCE;

/** \\brief  Upstream Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_USR_Bits B;
} Ifx_MSC_USR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Msc_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  MSC object */
typedef volatile struct _Ifx_MSC
{
    Ifx_MSC_CLC CLC;                        /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_MSC_ID ID;                          /**< \brief 8, Module Identification Register */
    Ifx_MSC_FDR FDR;                        /**< \brief C, Fractional Divider Register */
    Ifx_MSC_USR USR;                        /**< \brief 10, Upstream Status Register */
    Ifx_MSC_DSC DSC;                        /**< \brief 14, Downstream Control Register */
    Ifx_MSC_DSS DSS;                        /**< \brief 18, Downstream Status Register */
    Ifx_MSC_DD DD;                          /**< \brief 1C, Downstream Data Register */
    Ifx_MSC_DC DC;                          /**< \brief 20, Downstream Command Register */
    Ifx_MSC_DSDSL DSDSL;                    /**< \brief 24, Downstream Select Data Source Low Register */
    Ifx_MSC_DSDSH DSDSH;                    /**< \brief 28, Downstream Select Data Source High Register */
    Ifx_MSC_ESR ESR;                        /**< \brief 2C, Emergency Stop Register */
    Ifx_MSC_UD UD[4];                       /**< \brief 30, Upstream Data Register */
    Ifx_MSC_ICR ICR;                        /**< \brief 40, Interrupt Control Register */
    Ifx_MSC_ISR ISR;                        /**< \brief 44, Interrupt Status Register */
    Ifx_MSC_ISC ISC;                        /**< \brief 48, Interrupt Set Clear Register */
    Ifx_MSC_OCR OCR;                        /**< \brief 4C, Output Control Register */
    unsigned char reserved_50[8];           /**< \brief 50, \internal Reserved */
    Ifx_MSC_DSCE DSCE;                      /**< \brief 58, Downstream Control Enhanced Register 1 */
    Ifx_MSC_USCE USCE;                      /**< \brief 5C, Upstream Control Enhanced Register 1 */
    Ifx_MSC_DSDSLE DSDSLE;                  /**< \brief 60, Downstream Select Data Source Low Extension Register */
    Ifx_MSC_DSDSHE DSDSHE;                  /**< \brief 64, Downstream Select Data Source High Register */
    Ifx_MSC_ESRE ESRE;                      /**< \brief 68, Emergency Stop Extension Register */
    Ifx_MSC_DDE DDE;                        /**< \brief 6C, Downstream Data Extension Register */
    Ifx_MSC_DDM DDM;                        /**< \brief 70, Downstream Data Mirror Register */
    Ifx_MSC_DSTE DSTE;                      /**< \brief 74, Downstream Timing Extension Register */
    unsigned char reserved_78[8];           /**< \brief 78, \internal Reserved */
    Ifx_MSC_ABC ABC;                        /**< \brief 80, Asynchronous Block Configuration Register */
    unsigned char reserved_84[100];         /**< \brief 84, \internal Reserved */
    Ifx_MSC_OCS OCS;                        /**< \brief E8, OCDS Control and Status */
    Ifx_MSC_KRSTCLR KRSTCLR;                /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_MSC_KRST1 KRST1;                    /**< \brief F0, Kernel Reset Register 1 */
    Ifx_MSC_KRST0 KRST0;                    /**< \brief F4, Kernel Reset Register 0 */
    Ifx_MSC_ACCEN1 ACCEN1;                  /**< \brief F8, Access Enable Register 1 */
    Ifx_MSC_ACCEN0 ACCEN0;                  /**< \brief FC, Access Enable Register 0 */
} Ifx_MSC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMSC_REGDEF_H */
